class TravelLocation {
  int id;
  String name;
  String imageHash;
  String image;
  String town;
  String info;
  double longitude;
  double latitude;
  double range;
  List<int> ratings;
  TravelLocation(
      {this.name,
      this.image,
      this.town,
      this.id,
      this.range,
      this.info,
      this.latitude,
      this.longitude,
      this.ratings,
      this.imageHash});

  factory TravelLocation.fromJson(Map<String, dynamic> json) {
    return TravelLocation(
        name: json['name'],
        image: json['image'],
        imageHash: json['imageHash'],
        town: json['town'],
        id: json['id'],
        info: json['info'],
        latitude: json['latitude'],
        longitude: json['longitude'],
        ratings: List.from(json['ratings']));
  }

  Map<String, dynamic> toMap() {
    return {
      'name': name,
      'image': image,
      'imageHash': imageHash,
      'town': town,
      'id': id,
      'info': info,
      'latitude': latitude,
      'longitude': longitude,
      'ratings': ratings,
    };
  }
}

class PlacesData {
  List<TravelLocation> placesForUpload = [
    TravelLocation(
        id: 1,
        town: "Банско",
        name: 'Музей \"Велянова къща\"',
        info:
            'Веляновата къща е архитектурно - етнографски музей, чиято декоративна украса е обявена за паметник на културата с национално значение. Това е най-оригиналната банска укрепена къща от епохата на Възраждането, която е запазена и до наши дни. Веляновата къща в Банско е била собственост на богато семейство, но когато заможният й стопанин бил на път, нахлули разбойници и убили жена му. Той не се върнал повече в нея и къщата запустяла. През 1835 къщата е подарена от банскалии на Уста /майстор/ Велян Огнев, поканен да участва в украсата и обзавеждането на храма \"Света Троица\". Той я изографисва отвътре и отвън, превръщайки я в истинско произведение на изкуството. Къщата е била много модерна за времето си двукатна къща, градена само от камък и дърво, с характерните две взаимосвързани в приземието скривалища и пет стаи на етажа с чардак. Голяма ценност представляват стенописната украса на \"Синята стая\", изкусната дърворезба на чардака /централната розета/, геометричните и растителни мотиви в югоизточната стая на южната фасада. В едно от приземните помещения е организирана етнографска изложба-базар, подобна на тази в Дома на изкуствата и поезията.',
        image:
            'https://www.btsbg.org/sites/default/files/obekti/velyanova-kushta.jpg',
        imageHash: 'L9GSVv?pIW00Dd=htR9F.j01?cnl',
        latitude: 41.835167,
        longitude: 23.488167,
        ratings: []),
    TravelLocation(
        id: 2,
        town: "Банско",
        name: 'Къща - музей \"Неофит Рилски\"',
        info:
            'Къщата е архитектурно-строителен и исторически паметник на културата с национално значение. Това е родната къща на Неофит Рилски /Бенината/. В нея той живее до 1811 г. Тя е типичен образец на банската архитектура от краяна XVII и началото на XIX в. Патриархът на новобългарското образование и просвета Неофит Рилски /роден 1793/ учи иконопис при Тома Вишанов – Молера - основоположник на Банската художествена школа. Рисува в Рилския манастир, където по-късно става и монах. Целият му живот е отдаден на науката и просветата. Автор е на първата българска граматика /1835 г./. Oт 1981 г. къщата функционира като музей. Състои се от две части - автентично запазената къща на бележития възрожденец с етнографска експозиция и документална експозиция, излагаща най-ценното от богатото наследство на Неофит Рилски - главно писма, снимки и книжовен материал. Във фонда се съхраняват над 400 документални и веществени материали.',
        image:
            'https://www.btsbg.org/sites/default/files/styles/768x576/public/obekti/kushta-neofit-rilski.jpg',
        imageHash: 'LNG]BPWQ~pIn=~4.xuM{.QtM%LWm',
        latitude: 41.8354,
        longitude: 23.48709,
        ratings: []),
    TravelLocation(
        id: 3,
        town: "Банско",
        name: 'Музей \"Никола Вапцаров\"',
        info:
            'Родната къща на поета Никола Вапцаров е превърната в музей през 1952г. След 3 реконструкции - 1960, 1979 и 1992 г. - сегашната експозиция е направена на високо професионално ниво и се отличава с нетрадиционния за мемориален музей метод на поднасяне на информацията. По указания на членовете на семейството на поета - майка му Елена, брат му Борис и сестра му Райна - отчасти е възстановена домашнобитовата среда и обстановката по време на неговото детство. Музея има 3 функционални части - видеозала в 2 помещения /с капацитет 40 места/, където е представено и родословното дърво на поета; автентична етнографска експозиция и видеозала - "Поезията на Вапцаров". В музея са изложени и копия от ръкописите на Вапцаров, първите публикации на неговите стихове, събрани по-късно в отделна стихосбирка. Във витрина се пазят костюмът, ризата и часовникът, носени от поета преди разстрела. Музеят разполага с готови беседи чрез видеоматериал на английски, немски, френски и руски език. Къщата-музей е обединена в един комплекс с Дома на изкуствата и поезията.',
        image:
            'https://www.btsbg.org/sites/default/files/obekti/muzei-nikola-vapcarov.jpg',
        imageHash: 'LJG8_+00kXIB~q9Fxujs%NIUaet7',
        latitude: 41.837355,
        longitude: 23.48866,
        ratings: []),
    TravelLocation(
        id: 4,
        town: "Банско",
        name: 'Иконна изложба',
        info:
            'Постоянната иконна изложба е уредена в най-старата и запазена сграда в Банско - 1749 г. Обявена е за паметник на културата. Къщата е изпълнявала функциите на женски метох към Хилендарския, а по-късно към Рилския манастир. В шест изложбени зали се проследява развитието на Банската иконописна школа от стенописи, в т.ч. от Рилския манастир. Изложбата разполага с готови беседи на английски, немски, френски и руски език и озвучаване с църковни песнопения.Иконната изложба, сполучливо настанена в сградата на възстановения метох, дава великолепна представа за наследството, оставили колоритните даровити творци от Банско през 18 и 19 век, което ги нарежда между най-високите постижения на българския творчески гений. Макар да си сътрудничат с другите културни центрове в страната/ Самоков, Дебър и Трявна /, те запазват докрай самобитните стилови отлики на своето изкуство.Родоначалник на Банската художествена школа е Тома Вишанов, който се завръща със самочувствие след престоя си в няколко европейски страни. И повлиян от влечението и интереса си към мимолетното и трудноуловимото в изображенията на човека, смело експериментира. Най-добро доказателство за това е изключително ценната икона „Благославящият Христос", където Спасителят е нарисуван като испански благородник. Делото му е продължено от неговия син Димитър и внукът му Симеон Молерови.',
        image:
            'https://www.btsbg.org/sites/default/files/obekti/ikonna-izlojba.jpg',
        imageHash: 'LJF#H^?Ko%i^%gXBIubuW9IURkR-',
        latitude: 41.836094,
        longitude: 23.488244,
        ratings: []),
    TravelLocation(
        id: 5,
        town: "Банско",
        name: 'Църква Св.Троица',
        info:
            'Храмовият комплекс "Света Троица" е една от най-големите исторически и културни забележителности на град Банско. Църквата, която като архитектурен тип представлява трикорабна псевдо базилика и е една от най-големите в страната, е строена през1835 г. от местни строители - Григор Доюв, Лазар Глушков по инициативата и с материалната подкрепа на влиятелния търговец Лазар Герман (Голев).ÃÂ Иконостасът и рисунките по колоните и свода в нея са дело на Велян Огнев - представител на Дебърската художествена школа, а иконите са изписани от прочутите майстори на Банската иконописна школа Димитър и Симеон Молерови. Църквата е образец на великолепен синтез между архитектурни обеми и пространства, дърворезба, фрескова живопис и икони. Нейният величествен силует прекрасно хармонира с изградената в непосредствена близост тридесет метрова часовникова кула-камбанария.Църквата е дълга 44 м, широка 22 м и е висока 9,5 м.',
        image:
            'https://www.btsbg.org/sites/default/files/obekti/tsarkva-sveta-troitsa-bansko.jpg',
        imageHash: 'LmLN*:xb4nja_N%MITj[xuM{WBof',
        latitude: 41.835694,
        longitude: 23.487222,
        ratings: []),
  ];
}
